""""
1) Вывести на экран все простые числа в заданном диапазоне (диапазон вводится с клавиатуры). – 2 балла

2) С клавиатуры вводится текст, определить, сколько в нём гласных, а сколько согласных. В случае равенства вывести на экран все гласные буквы. Посчитать количество слов в тексте. – 1 балл

3) Дан список чисел. Посчитайте, сколько в нем пар элементов, равных друг другу. Считается, что любые два элемента, равные друг другу образуют одну пару, которую необходимо посчитать. – 2 балла

4) Дана строка в виде случайной последовательности чисел от 0 до 9
Требуется создать словарь, который в качестве ключей будет принимать данные числа (т. е. ключи будут типом int), а в качестве значений – количество этих чисел в имеющейся последовательности. – 2 балла

5) Реализуйте программу «Магазин автозапчастей», которая будет включать в себя шесть пунктов меню.  У вас есть словарь, где ключ – название продукции. Значение – список, который содержит состав продукции, цену и кол-во (шт),которое есть в магазине.
1.	Просмотр описания: название – описание
2.	Просмотр цены: название – цена.
3.	Просмотр количества: название – количество.
4.	Всю информацию.
5.	Покупка
В пункте «Покупка» необходимо совершить покупку,  с клавиатуры вводите название продукции и его кол-во, n – выход из программы. Посчитать цену выбранных товаров и сколько товаров осталось в изначальном списке
6.	До свидания – 2 балла

6) Дан кортеж целых чисел. Найти индекс первого отрицательного элемента. – 1 балл"
"""""

